# 06: Mengganti nama (label) kolom pada Data Frame

# Import Modules

In [4]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [7]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  3  4  9  7  4
1  4  9  2  7  2
2  4  7  4  6  2
3  2  4  3  2  9
4  8  7  6  1  7

# Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [10]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  3  4     9  7  4
1  4  9     2  7  2
2  4  7     4  6  2
3  2  4     3  2  9
4  8  7     6  1  7

# Mengganti nama (label) untuk banyak kolom pada Data Frame

In [13]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     3       4  9     7  4
1     4       9  2     7  2
2     4       7  4     6  2
3     2       4  3     2  9
4     8       7  6     1  7